00:00 - Вступление - о чем видео

00:49 - Что такое программирование

02:04 - ПК ваш магический друг понимающий только язык программирования

02:26 - Что такое программа

03:09 - Что войдет в практическую часть видео

03:34 - С чего начать разработку программы ?

04:28 - Где хранить данные программы? Что такое переменная ?

05:04 - Что такое тип данных в программировании ?

05:33 - Типы данных в PHP

06:02 - Тип данных NULL

06:37 - Склярные типы данных в PHP (bool, int, float, string)

08:05 - Тип данных array - массив

10:12 - Тип данных object - объект

10:19 - Что такое class в PHP

10:30 - Тип данных resource - ресурс

11:24 - Тип данных void - never - сравнение с NULL

13:29 - Тип данных callable - функция

14:39 - Начало практической части

15:00 - Виды комментариев в PHP

21:40 - Запускаем встроенный в PHP сервер для исполнения скрипта на PHP

22:20 - Что такое PHP

24:21 - Оператор присваивания в PHP

25:24 - Управляющие конструкции в PHP - операторы ветвления логики IF-ELSE

26:07 - Как получить значение от пользователя в PHP, как передать информацию ?

27:10 - Панель DevTools браузера - как открыть ?

27:49 - GET - метод HTTP запроса к серверу для передачи данных в PHP

28:12 - Методы передачи данных, как можно передать информацию в PHP ?

31:37 - 500я ошибка на экране - Undefined array key - что она означает ?

32:35 - Используем null coalescing operator для исправления ошибки

33:07 - Как проверить версию PHP в терминале (команда php -v)

36:19 - Пишем условные конструкции - обрабатываем логику программы

37:38 - Снова 500я ошибка - Undefined variable $result - что делать?

40:08 - Особенность HTTP протокола в части типов данных передаваемых по сети

41:00 - Используем оператор приведения типов

44:04 - Оператор конкатенации в PHP - склеиваем строки

44:56 - Строгий режим работы PHP с типами - как включить строгую типизацию ?

46:29 - Используем оператор PHP return

47:36 - Твоя первая копипаста в программировании - нарушаем DRY

48:45 - Заключение - что будет в следующей части видео ?
