<?php

// Арифметические операции

/**
 * +$a    Идентичность    Конвертация значения переменной $a в целое число (int) или число с плавающей точкой (float), если нужно.
 * -$a    Отрицание    Смена знака $a.
 * $a + $b    Сложение    Сумма $a и $b.
 * $a - $b    Вычитание    Разность $a и $b.
 * $a * $b    Умножение    Произведение $a и $b.
 * $a / $b    Деление    Частное от деления $a на $b.
 * $a % $b    Деление по модулю    Целочисленный остаток от деления $a на $b.
 * $a ** $b    Возведение в степень    Возведение значения переменной $a в степень, указанную в переменной $b.
 */

// задача: у нас есть массив $numbers, в котором есть разные числа, как положительные, так и отрицательные. Нужно вывести только отрицательные числа

// задача: у нас есть массив $numbers, в котором есть разные числа. Нужно вывести только четные числа.


